[
  {
    "id": 1,
    "title": "5e Encounter Builder",
    "link": "https://5eCombatEncounter.kruskopf.org",
    "shortDescription": "A web application built with Vue.js An encounter builder for RPG system 5E.",
    "description": "This application is a school project designed as an encounter builder for the RPG system 5e. It is a web application built with Vue.js. that utilizes the Open5e API. The current functionality includes listing a handful of monsters and adding them to a combat list, and optionally create your own monster and add to combat. Combat list is stored in local storage. Future development plans include extending the functionality to allow searching and filtering monsters, as well as saving monsters to a favorites list.",
    "repoLink": "https://github.com/Mattan41/5eEncounterBuilder",
    "repoName": "5eEncounterBuilder",
    "otherLink": "https://open5e.com/api-docs"
  },
  {
    "id": 2,
    "title": "Top Flicks",
    "link": "https://topflicks.kruskopf.org/",
    "shortDescription": "A web application built with HTML, CSS, and JavaScript.",
    "description": "Top Flicks is a school project web application built with HTML, CSS, and JavaScript for browsing and managing your favorite movies. Users can register, log in, search for movies, and add them to their favorites.",
    "repoLink": "https://github.com/Mattan41/labb-html-css-javascript",
    "repoName": "labb-html-css-javascript"
  },
  {
    "id": 3,
    "title": "Cinema Scala",
    "link": "#",
    "shortDescription": "A web application for scheduling and booking movie viewings, Frontend: JavaScript, Vue.js, Tailwind CSS; Backend: Java, Spring Boot, MongoDB",
    "description": "Cinema Scala is a school group project, a web application booking system for movie tickets at a Cinema. The frontend is built in Vue.js and the backend is built with Spring Boot. Users can create an account and login with oath2 google-id. Admin can log on to admin panel and schedule viewings of movies. For oath2 you need a client-id and client-secret, and to populate the database with movies you need a access token from TMDB",
    "repoLink": "https://github.com/Mattan41/projekt-cinema-scala",
    "repoName": "projekt-cinema-scala"
  },
  {
    "id": 4,
    "title": "Spring boot application for messaging",
    "link": "#",
    "shortDescription": "A web-based messaging platform built using Java, Spring Boot, and Thymeleaf.",
    "description": "A group project I participated in, where we built a web-based messaging platform built using Java, Spring Boot, and Thymeleaf. It allows users to create, edit, and view messages. The application supports user authentication and authorization, message translation, and provides a user-friendly interface for managing messages. It uses a MySQL database for data storage and integrates with various Spring Boot starters for functionality such as data access, security, and validation. Additionally, there is a branch updates messages using HTMX.",
    "repoLink": "https://github.com/Mattan41/springBootGroupProject",
    "repoName": "springBootGroupProject"
  },
  {
    "id": 5,
    "title": "SPI-unitconverter",
    "link": "#",
    "shortDescription": "A Java application for converting units using the Service Provider Interface (SPI) pattern.",
    "description": "This Java application is built with pattern Service Provider Interface (SPI). The program allows users to select from various Converter implementations to perform conversions between different units. The application includes a simple command-line interface for user input and output.",
    "repoLink": "https://github.com/Mattan41/SPI-unitconverter",
    "repoName": "SPI-unitconverter"
  },
  {
    "id": 6,
    "title": "Jakarta Project with WildFly",
    "link": "#",
    "shortDescription": "Restful Web Service Implementation with JAX-RS, Jakarta EE, and WildFly.",
    "description": "This project is a Java-based application built with Jakarta EE and running on the WildFly application server. The application includes comprehensive integration tests using Testcontainers and RestAssured to ensure robust and reliable functionality. Docker and Docker Compose are used to containerize the application and manage multi-container setups. It allows users to perform CRUD (Create, Read, Update, Delete) operations on a collection of movies stored in a MySQL database. Users can: Create new movie entries. Read all movies or a specific movie by its UUID. Update existing movie details. Delete movies by their UUID. The application exchanges data in JSON format and uses Data Transfer Objects (DTOs) to handle data between the client and server. It also includes error handling, data validation, and is containerized using Docker for easy deployment.",
    "repoLink": "https://github.com/Mattan41/projektJakarta",
    "repoName": "JakartaProject"
  },
  {
    "id": 7,
    "title": "Search Service for Chatgut",
    "link": "#",
    "shortDescription": "A microservice for searching message content using Elasticsearch.",
    "description": "A microservice I built as a school project in the chatgut organization, enables users to search message content using Elasticsearch. The service is built with Java and Spring Boot. There is also a branch where deployment is done with Kubernetes.",
    "repoLink": "https://github.com/Mattan41/searchService3",
    "repoName": "searchService3"
  }
]